# Спецсимволы:
# \n – новая строка
# \t – табуляция
# \v – вертикальная табуляция
# \\ - \
# \' - '
# \'' - ''
# \a – звонок
# \b – забой
# \f – перевод страницы
# \r – возврат коретки в начало строки
# \0HH – символ с двоичным номером HH
# \xHH – символ с шестнадцатеричным номером HH
# \oOO – символ с восьмеричным значением OO
# \0 – пустой символ
# \N{ID} – символ с ID из базы юникода
# \uhhhh – символ юникода с 16-битным шестнадцатеричным значением
# \Uhhhhhhh - символ юникода с 32-битным шестнадцатеричным значением

print('11111\0 222')
